Revit 2015 API
FabricRoundingManager Properties
The FabricRoundingManager type exposes the following members.
Properties
Name | Description
ApplicableReinforcementRoundingSource
 Identifies the source of the rounding settings for this element.
ApplicableTotalLengthRounding
 The applicable rounding for Cut Overall Length and Cut Overall Width parameters.
Element
 The owner of the reinforcement rounding overrides.
 (Inherited from ReinforcementRoundingManager.)
IsActiveOnElement
 Defines whether reinforcement rounding is activated for the particular element.
 (Inherited from ReinforcementRoundingManager.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from ReinforcementRoundingManager.)
LengthDisplayUnit
 The length units used when displaying the reinforcement rounding values.
 (Inherited from ReinforcementRoundingManager.)
TotalLengthRounding
 The rounding for Cut Overall Length and Cut Overall Width parameters.
See Also
FabricRoundingManager Class
Autodesk.Revit.DB.Structure Namespace